app/Controllers/Category.php

    public function fetchCategoryList() {
        try {
            $category_model = new Category_model();
            $categoryList = $category_model->where(['is_deleted' => 0])->findAll();
---
SELECT *
FROM `category`
WHERE `is_deleted` = 0

    public function category_submit() {
        $formData = $this->request->getJSON();

        try {
            $mode           = $formData->mode;
            $id             = $formData->id;

            $title          = $formData->title;
            $description    = $formData->description;
            $priority       = $formData->priority;

            $slug           = $this->slugify($title);

            $category_model = new Category_model();

            // check duplicate slug
            $existing = $category_model->select(['slug'])->where(['slug' => $slug])->first();

            if($mode == "Add") {

                if($existing) {
                    $count = 2;
                    $baseSlug = $slug;

                    while($category_model->where(['slug'=> $slug])->first()) {
                        $slug = $baseSlug . '-' . $count++;
                    }
                }

                $inserted = $category_model->insert([
                    'title'         => $title,
                    'slug'          => $slug,
                    'description'   => $description,
                    'priority'      => $priority,
                    'created_date'  => date('Y-m-d H:i:s')
                ]);
---
SELECT *
FROM `category`
WHERE `slug` = 'test-slug'
 LIMIT 1
INSERT INTO `category` (`title`, `slug`, `description`, `priority`, `created_date`) VALUES ('Test Slug', 'test-slug-1', 'test', '99', '2025-06-18 10:53:42')