app/Controllers/Company.php

    public function fetchCompanyList() {
        try {
            $company_model = new Company_model();
            $companyList = $company_model->where(['is_deleted' => 0])->findAll();
---
SELECT *
FROM `company`
WHERE `is_deleted` = 0