app/Controllers/Home.php

    public function fetchCompanyList() {
        try {
            $company_model = new Company_model();
            $companyList = $company_model->where(['is_deleted' => 0])->findAll();
---
SELECT *
FROM `company`
WHERE `is_deleted` = 0

    public function company_upsert($id=""){
        if($id == "") {
            $this->data['mode'] = "Add";
        } else {
            $this->data['mode'] = "Edit";
            $this->data['id'] = $id;

            $company_model = new Company_model();
            $companyData = $company_model->find($id);
---
SELECT *
FROM `company`
WHERE `company`.`company_id` = '1'

    public function company_submit() {
        $formData = $this->request->getJSON();

        try {
            $mode           = $formData->mode;
            $id             = $formData->id;

            $name           = $formData->name;
            $description    = $formData->description;
            $address        = $formData->address;
            $email          = $formData->email;
            $phonenum       = $formData->phonenum;
            $brn            = $formData->brn;
            $status         = $formData->status;

            $company_model = new Company_model();

            if($mode == "Add") {
                $inserted = $company_model->insert([
                    'name'          => $name,
                    'description'   => $description,
                    'address'       => $address,
                    'email'         => $email,
                    'phonenum'      => $phonenum,
                    'brn'           => $brn,
                    'status'        => $status,
                    'created_date'  => date('Y-m-d H:i:s')
                ]);
---
INSERT INTO `company` (`name`, `description`, `address`, `email`, `phonenum`, `brn`, `status`, `created_date`) VALUES ('bbb', 'bb', 'bb', 'bb', 'bb', '343244', '1', '2025-06-17 14:04:15')

                    ]);
                }
            } else {
                $modified = $company_model->update($id, [
                    'name'          => $name,
                    'description'   => $description,
                    'address'       => $address,
                    'email'         => $email,
                    'phonenum'      => $phonenum,
                    'brn'           => $brn,
                    'status'        => $status,
                    'modified_date'  => date('Y-m-d H:i:s')
                ]);
---
UPDATE `company` SET `name` = 'ccc', `description` = 'cc', `address` = 'cc', `email` = 'cc', `phonenum` = 'bb', `brn` = '343244', `status` = '1', `modified_date` = '2025-06-17 14:04:31'
WHERE `company`.`company_id` IN ('7')