app/Controllers/Product.php

SELECT `product`.*, `category`.`title` AS `category_title`
FROM `product`
LEFT JOIN `category` ON `category`.`category_id` = `product`.`category_id`
WHERE `product`.`is_deleted` = 0
---
    public function fetchProductList() {
        try {
            $product_model = new Product_model();
            $category_model = new Category_model();
            $productList = $product_model
                                ->select('product.*, category.title AS category_title')
                                ->join('category','category.category_id = product.category_id','left')
                                ->where(['product.is_deleted' => 0])
                                ->findAll();