app/Controllers/Promo_code.php

    public function fetchPromoCodeList() {
        try {
            $promo_code_model = new Promo_code_model();
            $promoCodeData = $promo_code_model->where([
                'is_deleted' => 0
            ])->findAll();
---
SELECT *
FROM `promo_code`
WHERE `is_deleted` = 0

    public function fetchPromoCodeOne() {
        $code = $this->request->getJSON(true);
        $code = $code['code'];

        try {
            $promo_code_model = new Promo_code_model();
            $promoCodeData = $promo_code_model->where([
                'code' => $code,
                'is_deleted' => 0
            ])->first();
---
SELECT *
FROM `promo_code`
WHERE `promo_code_id` = '3'
AND `is_deleted` = 0
 LIMIT 1