app/Controllers/User.php

SELECT *
FROM `user`
WHERE `is_deleted` = 0
---
    public function fetchUserList() {
        try {
            $user_model = new User_model();
            $userList = $user_model->where(['is_deleted' => 0])->findAll();

SELECT *
FROM `user`
WHERE `user`.`user_id` = '10'
---
    public function user_upsert($id=""){
        if($id == "") {
            $this->data['mode'] = "Add";
        } else {
            $this->data['mode'] = "Edit";
            $this->data['id'] = $id;

            $user_model = new User_model();
            $userData = $user_model->find($id);

UPDATE `user` SET `name` = 'test', `email` = 'test', `phonenum` = '12345', `modified_date` = '2025-06-18 09:20:22'
WHERE `user`.`user_id` IN ('10')
---
                $builder = $cu_model->builder();

                // Update User_table
                $modified = $user_model->update($id, [
                    'name'          => $name,
                    'email'         => $email,
                    'phonenum'      => $phonenum,
                    'modified_date'  => date('Y-m-d H:i:s')
                ]);