app/Models/Product_model.php

    public function getAllProductList() {
        return $this->select(select: 'product.*, category.title AS category_title')
                    ->join('category','category.category_id = product.category_id','left')
                    ->where(['product.is_deleted' => 0,])
                    ->findAll();
---
SELECT `product`.*, `category`.`title` AS `category_title`
FROM `product`
LEFT JOIN `category` ON `category`.`category_id` = `product`.`category_id`
WHERE `product`.`is_deleted` = 0